{
    "dogs": [
        {
            "name": "Yanmar",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/yan4.jpg",
            "description": "Gold-Sierra Yanmar was imported directly from Gold-Sierra Kennel in Hungary in the fall of 2018.&nbsp; This boy has consistently cloned himself time and time again.&nbsp; With a super small stature, yet having a huge head, massive bone and lots of substance, he is an ideal French Bulldog specimen.&nbsp; He weighs 20-22lbs and is standard colors only, but does carry pied.&nbsp; Yanmar is also health tested clear of CMR1, PRA cord1, DM, HUU and JHC.&nbsp; He will be closed to the public after July 9th of 2023 when he turns 5 years old.\n\n\n\nYanmar is retired to the public but will still be used in house here and there\n\n\n\nDNA: ayay DD EMEM NS kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/yanmar/"
        },
        {
            "name": "Party Monster",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_3407.jpeg",
            "description": "Texas Top Notch Party Monster was produced right here back in June of 2018.&nbsp; He is our smallest stud weighing a whopping 17-18 lbs.&nbsp; Party Monster is super small, compact and has a beautiful headpiece.&nbsp; He is also probably our quietest and most laid back dog.&nbsp; Party Monster has produced many offspring that have his beautiful look while staying small, including his daughter, Rudolph, we have here.&nbsp; He is standard colors but does carry a copy of cocoa.&nbsp; Party Monster is health tested clear of CMR1, PRA-cord1, DM, HUU, JHC and Cystinuria 3. This boy is open for stud and we have the ability to ship same day or overnight.\n\n\n\nStud Fee: $2000 (Party Monster will be closing to the public June 21, 2023)\n\n\n\nDNA: ayay DD Coco EME nn kyky\n\n\n\n​",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/party-monster/"
        },
        {
            "name": "Odyn",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Odyn-1.jpeg",
            "description": "Texas Top Notch Odyn the Great was produced right here back in March of 2020.&nbsp; This guy is out of our amazing Yanmar and is a prime example of the quality Yanmar produces.&nbsp; He is 1/2 brother to Yuki , Yenko, Yuli and Yakka. Odyn is built like a box and has an amazing head with a full rope, ridiculous bone and lots of substance on his small, compact frame.&nbsp; He is a tad heavier than his daddy but almost identical in height and structure.&nbsp; This guy looks like a little teddy bear and is the sweetest dog.&nbsp; Odyn is health tested clear of&nbsp; JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3.&nbsp; He is standard colors but carries both cream and pied.&nbsp; He is the sire to our beautiful girl, Neva that can be seen on the females page.\n\n\n\nStud Fee: $2500\n\n\n\nDNA: ayay DD EMe NS KbrKy",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/odyn/"
        },
        {
            "name": "Thunder Cat",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9501-1.jpg",
            "description": "Thunder Cat comes to us from 3D Kennels. He has been with us since he was 8 weeks old back in 2020.&nbsp; Thunder is a beautiful chocolate and tan boy that carries blue with lots of bone and substance and an amazing headpiece.&nbsp; He has the signature gold eyes that are simply mesmerizing.&nbsp; Thunder has several litters under his belt and seems to produce very consistently. He is health tested clear of CMR1, PRA-cord1, DM, HUU, JHC and Cystinuria 3. &nbsp;\n\n\n\nStud Fee: $2500​\n\n\n\nDNA: atat coco Dd EME nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/thunder-cat/"
        },
        {
            "name": "Kofi",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Kofi.jpeg",
            "description": "Kofi unfortunately passed away tragically in may of 2022\n\n\n\nTexas Top Notch Blue Tri Kofi was produced right here back in January of 2019. Kofi is full littermate brother to Kaz and 1/2 brother to Cartel, Peavy and Tonga. This guy is a beautiful blue and tan boy that carries cocoa and has excellent bone, lots of substance and a huge head, all while remaining correct.&nbsp; He has produced some amazing offspring but most of those are outside breedings as he is closely related to almost all of our females.&nbsp; Kofi&nbsp;is health tested clear of CMR1, PRA cord1, DM, HUU, JHC and Cystinuria 3&nbsp; He is open for stud and we have the ability to ship same day or overnight. He does reside with his co-owner in the Houston area so if you are interested in using him for stud, please allow us ample notice so that arrangements can be made to have him here on the premises or to collect and ship.\n\n\n\nDNA: ata dd Coco EMEM nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/kofi/"
        },
        {
            "name": "Izzo",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/izzo.jpeg",
            "description": "Izzo was our very first French Bulldog that introduced us and made us fall head over heels in love with the breed back in 2013. He came to us as an 8 week old puppy from a breeder in Texas and once we got him, we were hooked. Izzo has the most amazing personality, is super intelligent and a very laid back, loving guy.&nbsp; He sired many dogs while here and several can be seen on our produced page.&nbsp; Izzo is now retired and living his best life with Roderick in Texas.&nbsp;\n\n\n\nDNA: ayay dd EMEM NS kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/izzo/"
        },
        {
            "name": "Ecko",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/312.jpeg",
            "description": "Ecko was the second male we added to our program back in 2016.&nbsp; He sired many amazing pups including our now retired girl, Trilogy.&nbsp; Other Ecko offspring can be seen on our Past Production Page.&nbsp; Ecko is now retired and spoiled rotten with his family in Mississippi.\n\n\n\nDNA: ayay DD EMe nn kbrky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/ecko/"
        },
        {
            "name": "Cartel",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Cartel.jpeg",
            "description": "Texas Top Notch Butler's Cartel was produced right here back in February of 2021.&nbsp; He is full littermate brother to Tonga and 1/2 brother to Kofi, Kaz and Peavy; sharing the same mom.&nbsp; Cartel is still young and has a lot of maturing to do but already looks extremely promising. Cartel is a blue and tan merle that carries chocolate and cream. This boy is health tested clear of CMR1, PRA-cord1, DM, HUU, JHC and Cystinuria 3&nbsp; Cartel has some amazing offspring out there and has only gotten better with age.&nbsp;\n\n\n\nStud Fee: $2500\n\n\n\nDNA: atat dd Coco EMe nn kyk Mm268",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/cartel/"
        },
        {
            "name": "Malakai",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/malakai1-1.jpg",
            "description": "Malakai comes to us by way of&nbsp; French Bullys and just turned a year old in late March of 2022. Kai is still young and has a lot of maturing to do, but already has great structure, is compact and thick with a massive noggin.&nbsp; He is a complete goof and just all around great dog.&nbsp; Kai is solid chocolate and carries both blue and cream. This boy is health tested clear of CMR1, PRA-cord1, DM, HUU, JHC and Cystinuria 3. Malakai is open for stud and we have the ability to ship same day or overnight.&nbsp;\n\n\n\nStud Fee: $2000\n\n\n\nDNA: aa coco Dd EMe nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/malakai/"
        },
        {
            "name": "Paper Trail",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/paper60628.jpg",
            "description": "Paper Trail was produced right here out of our very own Kayda and an outside male named Hush Money.&nbsp; Paper Trail is littermate brother to The Bread Winner, Cash Money and our girl, Dirty Money.  He is the biggest baby and loves everybody.  Paper has the most beautiful coat color and eyes as well as having great bone, a nice compact body and a huge head.  This stunning boy is health tested clear of&nbsp; JHC, HUU, PRA-Cord1, CMR1 and Cystinuria 3. Paper Trail has some amazing offspring out there already and we have big plans to run him to a few of our girls as well.  \n\n\n\nStud Fee: $2500\n\n\n\nDNA: aa dd coco bb EmEm NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/paper-trail/"
        },
        {
            "name": "The Bread Winner",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9554.jpg",
            "description": "The Bread Winner was produced right here out of our very own Kayda, and an outside male named Hush Money.&nbsp; He is littermate brother to both Cash Money and Paper Trail as well as Dirty Money.  All 4 have the DNA and looks to boot! This boy has the most beautiful coat color and eyes as well as the bone, dome and body to make him the total package.  Bread Winner&nbsp;is health tested clear of&nbsp; JHC,&nbsp; HUU, PRA-Cord1, CMR1 and Cystinuria 3.&nbsp;&nbsp;\n\n\n\nStud Fee: $2500\n\n\n\nDNA: ata coco bb Dd EmEm nn kyky\n\n\n\n\n\n\n\n.",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/the-bread-winner/"
        },
        {
            "name": "Beef",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april15y.jpg",
            "description": "Beef was imported from Hungary in April of 2022 from Small Heroes Kennel.&nbsp; He was born in December of 2021 and is maturing very nicely.&nbsp; Beef is out of Thien Than's Valentino x Small-Heroes Bully Melek and is standard colors only.&nbsp;He has amazing structure, great bone, a huge head with lots of wrinkles and the most laid back, gentle personality.  This boy is health tested clear of&nbsp; JHC, HUU, PRA-Cord1, CMR1 and Cystinuria 3.&nbsp;His littermate sister Vida can be seen on our females page. \n\n\n\nStud Fee: $1500 intro\n\n\n\nDNA: ayay DD EmEm nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/beef/"
        },
        {
            "name": "Cash Money",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/cash5-1.jpg",
            "description": "Cash Money AKA Cash is also out of our Kayda x Hush Money litter and littermate to both Paper Trail and Bread Winner and our girl, Dirty Money.&nbsp; He is solid chocolate carries blue and testable.&nbsp; Cash is short and compact with great structure.&nbsp; This boy is health tested clear of JHC, HUU, PRA-Cord1, CMR1 and Cystinuria 3. He is co-owned w/ a family member and is now open for stud service.\n\n\n\nStud Fee: 2K\n\n\n\nDNA: aa coco Bb Dd EmEm nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/cash-money/"
        },
        {
            "name": "ABKC Champion Yenko",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/yenko-june21u.jpg",
            "description": "Yenko is out of Yanmar x Rudolph and was produced right here in June of 2022.  His pedigree is special as he is Yanmar bred to a Party Monster daughter.  Yenko is standard colors but does carry pied.  He is health tested clear for  CMR1, PRA-cord1, DM, HUU and JHC.  Yenko is practically a clone of his daddy and we have high expectations for this amazing little guy! After his first show debut in the fall of 2022, Yenko earned his champion status before even reaching 9 months old.  We will continue showing him and try for his grand champion title next.  Yenko is now open for stud to approved females and is proven.\n\n\n\nStud Fee: 2K\n\n\n\nDNA: ayay DD EmEm NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/yenko/"
        },
        {
            "name": "Kaz",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/326.jpeg",
            "description": "Texas Top Notch Kaz the Wanderlust was produced here back in January of 2019.&nbsp; Kaz is full littermate sister to Kofi and 1/2 sister to Cartel, Peavy and Tonga. She has one of the very best personalities and is practically perfect in conformation.&nbsp; Kaz is built like a male and has produced some super nice off spring such as our very own Kayda and Astra.&nbsp; This girl is a blue fawn that carries both cocoa and cream.&nbsp; \n\n\n\nDNA: aya dd Coco EMe nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/kaz/"
        },
        {
            "name": "Peavy",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/peavy12.jpeg",
            "description": "Texas Top Notch Blinding Lights aka Peavy was produced here back in September of 2019.  Peavy is 1/2 sister to Cartel, Tonga and Kaz; all sharing the same mom. She is a small girl with great substance and structure as well as a very sweet demeanor and eagerness to please.  Peavy is blue and tan and carries both cocoa and cream.  This girl is health tested clear of JHC, HUU, PRA-Cord1, CMR1 and Cystinuria 3. She produced a beautiful litter with our boy, Thunder Cat and was then bred to Narco for her second breeding and produced our amazing boy, Kamikaze and our girl, Pita. Peavy will most likely be bred again in late 2023 to one of our studs.\n\n\n\nDNA: atat dd Coco EMe nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/peavy/"
        },
        {
            "name": "Kayda",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9353.jpg",
            "description": "Texas Top Notch Hardest to Love aka Kayda was produced here back in June of 2020.  She is a very well built female like her beautiful mom, Kaz.  Kayda is a solid cocoa that carries both chocolate and blue.  She is a super short, thick girl w/ an amazing personality just like her mom. Kayda is mom to Paper Trail, Bread Winner, Cash Money and Dirty Money.    \n\n\n\n\n\n\n\nDNA: aa coco Bb Dd EME kyky&nbsp;",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/kayda/"
        },
        {
            "name": "Rudolph",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/20221106_194410.jpeg",
            "description": "Texas Top Notch Life of the Party aka Rudolph was produced here back in October of 2020.  She is line bred out of our boy, Party Monster and our now retired, Trilogy.  Rudolph is a very petite girl that has very nice structure, great headpiece, and the most amazing temperment.  She produced an amazing litter w/ Yanmar in June of 2022 which resulted in our boy, ABKC CH Yenko and our girl, Yuli. She will be bred again in the fall of 2023\n\n\n\nDNA: ayay DD EMEM nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/rudolph/"
        },
        {
            "name": "ABKC Champion Yuki",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april1e.jpg",
            "description": "Texas Top Notch CH Yuki was produced here back in October of 2020.  She is a Yanmar daughter and that is very obvious looking at her build and characteristics.  This girl is 1/2 sister to Odyn, Yakka, Yenko and Yuli. Yuki is extremely muscular and has very nice conformation and movement.   She is health tested clear of JHC, HUU and CMR1. Yuki earned her ABKC Champion title in April of 2023 after her show debut in late 2022.  She will be bred in the fall of 2023.\n\n\n\n\n\n\n\nDNA: ayay DD EMEM NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/yuki/"
        },
        {
            "name": "Yakka",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_3498.jpeg",
            "description": "Bully B Bulldogs Yakka of Texas Top Notch was co-produced w/ breeder Brittany Bell in November of 2020 and  is out of Yanmar and her beautiful girl, Gigi.  She is 1/2 sister to both Odyn , Yuli, Yenko and Yuki. Yakka is a very small girl and has great substance and structure.  She is health tested clear of JHC, HUU, DM, PRA-Cord1, CMR1 and Cystinuria 3. This girl will most likely be bred in 2023 to one of our studs.\n\n\n\nDNA: ayay DD EMe NS kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/yakka/"
        },
        {
            "name": "Tonga",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april15a.jpg",
            "description": "Texas Top Notch Heartless Valentine aka Tonga was produced here back on Valentine's Day of 2021.&nbsp; She is full littermate sister to Cartel and 1/2 sister Kofi, Kaz and Peavy; all 4 being out of Taja.&nbsp; Tonga is a very athletic, well built girl who is super smart.&nbsp; She is a harlequin merle that carries both cocoa and blue.&nbsp; This girl is health tested clear of JHC, HUU DM, PRA_Cord1, CMR1 and Cystinuria 3. Tonga was bred to Malakai and that pairing produced our beautiful chocolate merle girl, Toka.&nbsp; She will most likely be bred again in the fall of 2023.\n\n\n\nDNA: aa Dd Coco EME nn kyky Mm269",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/tonga/"
        },
        {
            "name": "Astra",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_0801.jpg",
            "description": "Texas Top Notch Lilac Astra was produced here back in March of 2021 out of Kaz and 908s Own Type R.   She is 1/2 sister to Kayda. Astra is a very small, correct female who loves to be the center of attention.  This girl is health tested clear of JHC, HUU, DM, CMR1 and Cystinuria 3. She produced an amazing litter with Odyn in the fall of 2023.\n\n\n\n\n\n\n\nDNA: ata dd coco EME nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/astra/"
        },
        {
            "name": "Dirty Money",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/dirty1.jpg",
            "description": "Dirty Money was produced right here and is out of our very own, Kayda, and an outside male named Hush Money.  Dirty is littermate sister to Cash Money, Breadwinner and Paper Trail. This girl has the exact same DNA as her mom but also carries pied.  Dirty is health tested clear of JHC, HUU, PRA_Cord1, CMR1 and Cystinuria 3. She will most likely be bred to CH Yenko in late 2023.\n\n\n\nDNA: aa coco Bb Dd EMEM NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/dirty-money/"
        },
        {
            "name": "Vida",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9416.jpg",
            "description": "This extremely tiny girl was imported along with her brother, Beef,  from Hungary in April of 2022 from Small Heroes Kennel.  She is standard colors only and super tiny.  Vida is health tested clear of JHC, DM, HUU, PRA-Cord1, and CMR1. This girl is super athletic and very compact with excellent structure.  We plan to take her to  Odyn in 2023.  \n\n\n\nDNA: ayay DD EmEm nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/vida/"
        },
        {
            "name": "Yuli",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april27r.jpg",
            "description": "Yuli was produced right here in June of 2022 out of Yanmar x Rudolph.&nbsp; She and her brother Yenko are very special to us as they are out of Yanmar bred to a Party Monster daughter, putting both of our amazing boys together in one pedigree,&nbsp; Yuli is standard colors but does carry pied.&nbsp; She is health tested clear of&nbsp;&nbsp;JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3. We have big plans for this beautiful little girl!\n\n\n\nDNA: ayay DD EmEm NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/yuli/"
        },
        {
            "name": "Toka",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/toka.jpg",
            "description": "Texas Top Notch After Hours Toka was produced here in July of 2022 out of Malakai and Tonga. Toka is an aa chocolate merle girl that carries both blue and cream.  She is health tested clear of JHC, DM, HUU, PRA_Cord1, CMR1 and Cystinuria 3. We are thinking of pairing her with either Bread Winner or Paper Trail depending on how she develops when she is of age.  \n\n\n\nDNA: aa coco Dd Ee nn kyky Mm268",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/toka/"
        },
        {
            "name": "Nika",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/NIKA1.jpeg",
            "description": "Nika was the 2nd female French Bullog we added to our program back in 2015.&nbsp; She was imported from Lithuania and is the main backbone to all of our color dogs today.&nbsp; Nika is mom to Taja, who is mom, grandma and great grandma to most all of our color dogs we have currently.&nbsp; Nika has since been retired and is living out her days with her wonderful owner Claire in Texas.\n\n\n\nDNA: aya Dd EMEM nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/nika/"
        },
        {
            "name": "Nola",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/2277.jpeg",
            "description": "Nola was the very first French Bulldog female we introduced to start our program back in 2015.&nbsp; She was imported from Lithuania and produced many nice dogs over the years; several can be seen on our Production Page.&nbsp; Nola has since retired and is living out her days being loved and spoiled by Stephanie and family in Texas.\n\n\n\nDNA: ayay DD EMEM NS kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/nola/"
        },
        {
            "name": "Toki",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/015.jpeg",
            "description": "Toki was the 3rd female French Bulldog we added to our growing program back in 2015,&nbsp; She traveled to us all the way from Hungary as a 4 month old pup.&nbsp; This girl is the backbone of our standard dogs here today.&nbsp;&nbsp;\n\n\n\nDNA: ayay DD EME NS kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/toki/"
        },
        {
            "name": "Trilogy",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/trilogy2.jpeg",
            "description": "Texas Top Notch Trill aka Trilogy was produced right here back in 2017 and is out of now retired dogs Ecko and Toki.&nbsp; This girl is super small and compact with the most sweet, comical personality.&nbsp; She is mother to our dogs Odyn and Rudolph as well as several others on our Produced Page.&nbsp; Trilogy and her mom are both retired&nbsp; now and are living out their lives together spoiled rotten with a family in Michigan.\n\n\n\nDNA: ayay DD EMEM nn kbrky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/trilogy/"
        },
        {
            "name": "Taja",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/production26.jpeg",
            "description": "Texas Top Notch Beauty Behind the Madness aka Taja was produced right here back in 2017 and is out of our girl Nika and an outside stud named Cruz.&nbsp; This girl really left her mark here being the mom, grandma and great grandma to several of our dogs today.&nbsp; Taja seemed to outproduce herself with each and every breeding.&nbsp; This beautiful girl is now retired and spoiled rotten with her wonderful owner Victoria in Texas.\n\n\n\nDNA: ata dd Coco EMEM nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/taja/"
        },
        {
            "name": "Pita",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/08/Pita2-1.jpg",
            "description": "Pita is out of Narco and our girl, Peavy.  She is full littermate sister to our boy, Kamikaze. Pita is exactly why we did this breeding as she is small, compact and correct with the most beautiful face and great bone.  She is health tested clear of JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3. Her personality is the absolute best as she loves to be held and loves attention.  Pita should be a great asset to our program in the future.\n\n\n\nDNA: atat dd coco EMe nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/pita/"
        },
        {
            "name": "Aspen",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/08/FB_IMG_1689609639627.jpg",
            "description": "Aspen was produced here in September of 2022 and he is out of Thunder Cat x Kaz.  This beautiful boy is a maskless chocolate fawn that carries tan points, blue and cream.  Aspen is health tested clear of JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3.  We are excited to see how this handsome guy matures and look forward to incorporating him into our breeding program. He is currently open for stud.\n\n\n\nStud Fee:  2K\n\n\n\nDNA: ayat coco Dd Ee nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/aspen/"
        },
        {
            "name": "Kamikaze",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0863.jpg",
            "description": "Kamikaze is our stunning lilac and tan merle boy that was produced right here out of Narco x Peavy in Decemeber of 2022.  He is full littermate brother to our girl, Pita.  Kaze is a lilac and tan merle that carries cream.  He has excellent structure and we are planning to start showing him once he hits 6 months old.  Kamikaze is health tested clear of CMR1, PRA-cord1, HUU, JHC and Cystinuria 3.  He is open for stud.\n\n\n\n                                                                        Stud Fee: 2K\n\n\n\nDNA: ata dd coco EMe nn kyky Mm268",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/kamikaze/"
        },
        {
            "name": "Neva",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0760.jpg",
            "description": "Neva is a beautiful little cream girl that is off Odyn and Scarlett (owned by a friend) and was born in February of 2023.  She is an amazing little girl with phenomenal structure, great bone and a beautiful head piece.  Neva is health tested clear of JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3.  We have big plans for this perfect little girl and hope to get her into the show ring later this year as well\n\n\n\nDNA: aya DD ee NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/neva/"
        },
        {
            "name": "Pyper",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/06/pyper30628.jpg",
            "description": "Pyper Rose is a beautiful fawn color carrier that we produced in December of 2021 out of Kaz x Griffin owned by Tasha Chasteen.  This girl puts alot of males to shame with her huge head and rope, crazy thick substance and bone.  Pyper is a fawn that carries blue, cocoa, cream and tan points. She is health tested clear of JHC, HUU, DM, PRA-Cord1, CMR1 and Cystinuria 3. Pyper was bred to Cash Money for her first breeding and we are looking forward to seeing those puppies grow and mature.\n\n\n\n\n\n\n\nDNA: ayat Dd Coco EMe nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/pyper/"
        },
        {
            "name": "Louie",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/12/IMG_9304.jpg",
            "description": "Louie is an amazing chocolate and tan male covered in cream sired by our male, Malakai and grandsired by our boy, Kofi.  Louie is a solid, structurally correct male with great bone, a huge head and a compact body with no tail.  He is a very nice representation of the breed with a super sweet, laid back temperament to boot.  Louie is health panel clear of JHC, HUU, CMR1, DM.  His C3 and PRA-CRD1 testing is pending. \n\n\n\n\n\n\n\nStud Fee: 2K\n\n\n\n                                                                            DNA: ata DD coco ee nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/louie/"
        },
        {
            "name": "High Roller",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0762.jpg",
            "description": "This stunning guy was produced right here in August of 2023 and is out of Cash Money x Pyper Rose.  He is an amazing looking young stud with the dna to match!  He is a lilac and tan that carries cream and testable. Roller is health tested clear of JHC, DM, HUU, PRA-Cord1,  CMR1 and Cystinuria 3.  We are excited to watch this beautiful boy mature and have big plans for him in our program.  We hope to have him open for stud in the summer of 2024.\n\n\n\n\n\n\n\n                                                             \n\n\n\nDNA: ata dd coco Bb eme nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/high-roller/"
        },
        {
            "name": "Bunny",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/02/IMG_0839.jpg",
            "description": "Bunny was born on September 11, 2023.  She is out of The Breadwinner x Sassy (Griffin x Kaz). This beautiful girl is staying super short but has crazy bone and substance for a female.  Bunny is health tested clear of JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3.  We have big plans for this beautiful girl.\n\n\n\n\n\n\n\nDNA: ata Coco Bb Dd emem nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/bunny/"
        },
        {
            "name": "Yanmar",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/yan4.jpg",
            "description": "Gold-Sierra Yanmar was imported directly from Gold-Sierra Kennel in Hungary in the fall of 2018.&nbsp; This boy has consistently cloned himself time and time again.&nbsp; With a super small stature, yet having a huge head, massive bone and lots of substance, he is an ideal French Bulldog specimen.&nbsp; He weighs 20-22lbs and is standard colors only, but does carry pied.&nbsp; Yanmar is also health tested clear of CMR1, PRA cord1, DM, HUU and JHC.&nbsp; He will be closed to the public after July 9th of 2023 when he turns 5 years old.\n\n\n\nYanmar is retired to the public but will still be used in house here and there\n\n\n\nDNA: ayay DD EMEM NS kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/yanmar/"
        },
        {
            "name": "Party Monster",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_3407.jpeg",
            "description": "Texas Top Notch Party Monster was produced right here back in June of 2018.&nbsp; He is our smallest stud weighing a whopping 17-18 lbs.&nbsp; Party Monster is super small, compact and has a beautiful headpiece.&nbsp; He is also probably our quietest and most laid back dog.&nbsp; Party Monster has produced many offspring that have his beautiful look while staying small, including his daughter, Rudolph, we have here.&nbsp; He is standard colors but does carry a copy of cocoa.&nbsp; Party Monster is health tested clear of CMR1, PRA-cord1, DM, HUU, JHC and Cystinuria 3. This boy is open for stud and we have the ability to ship same day or overnight.\n\n\n\nStud Fee: $2000 (Party Monster will be closing to the public June 21, 2023)\n\n\n\nDNA: ayay DD Coco EME nn kyky\n\n\n\n​",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/party-monster/"
        },
        {
            "name": "Odyn",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Odyn-1.jpeg",
            "description": "Texas Top Notch Odyn the Great was produced right here back in March of 2020.&nbsp; This guy is out of our amazing Yanmar and is a prime example of the quality Yanmar produces.&nbsp; He is 1/2 brother to Yuki , Yenko, Yuli and Yakka. Odyn is built like a box and has an amazing head with a full rope, ridiculous bone and lots of substance on his small, compact frame.&nbsp; He is a tad heavier than his daddy but almost identical in height and structure.&nbsp; This guy looks like a little teddy bear and is the sweetest dog.&nbsp; Odyn is health tested clear of&nbsp; JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3.&nbsp; He is standard colors but carries both cream and pied.&nbsp; He is the sire to our beautiful girl, Neva that can be seen on the females page.\n\n\n\nStud Fee: $2500\n\n\n\nDNA: ayay DD EMe NS KbrKy",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/odyn/"
        },
        {
            "name": "Thunder Cat",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9501-1.jpg",
            "description": "Thunder Cat comes to us from 3D Kennels. He has been with us since he was 8 weeks old back in 2020.&nbsp; Thunder is a beautiful chocolate and tan boy that carries blue with lots of bone and substance and an amazing headpiece.&nbsp; He has the signature gold eyes that are simply mesmerizing.&nbsp; Thunder has several litters under his belt and seems to produce very consistently. He is health tested clear of CMR1, PRA-cord1, DM, HUU, JHC and Cystinuria 3. &nbsp;\n\n\n\nStud Fee: $2500​\n\n\n\nDNA: atat coco Dd EME nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/thunder-cat/"
        },
        {
            "name": "Kofi",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Kofi.jpeg",
            "description": "Kofi unfortunately passed away tragically in may of 2022\n\n\n\nTexas Top Notch Blue Tri Kofi was produced right here back in January of 2019. Kofi is full littermate brother to Kaz and 1/2 brother to Cartel, Peavy and Tonga. This guy is a beautiful blue and tan boy that carries cocoa and has excellent bone, lots of substance and a huge head, all while remaining correct.&nbsp; He has produced some amazing offspring but most of those are outside breedings as he is closely related to almost all of our females.&nbsp; Kofi&nbsp;is health tested clear of CMR1, PRA cord1, DM, HUU, JHC and Cystinuria 3&nbsp; He is open for stud and we have the ability to ship same day or overnight. He does reside with his co-owner in the Houston area so if you are interested in using him for stud, please allow us ample notice so that arrangements can be made to have him here on the premises or to collect and ship.\n\n\n\nDNA: ata dd Coco EMEM nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/kofi/"
        },
        {
            "name": "Izzo",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/izzo.jpeg",
            "description": "Izzo was our very first French Bulldog that introduced us and made us fall head over heels in love with the breed back in 2013. He came to us as an 8 week old puppy from a breeder in Texas and once we got him, we were hooked. Izzo has the most amazing personality, is super intelligent and a very laid back, loving guy.&nbsp; He sired many dogs while here and several can be seen on our produced page.&nbsp; Izzo is now retired and living his best life with Roderick in Texas.&nbsp;\n\n\n\nDNA: ayay dd EMEM NS kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/izzo/"
        },
        {
            "name": "Ecko",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/312.jpeg",
            "description": "Ecko was the second male we added to our program back in 2016.&nbsp; He sired many amazing pups including our now retired girl, Trilogy.&nbsp; Other Ecko offspring can be seen on our Past Production Page.&nbsp; Ecko is now retired and spoiled rotten with his family in Mississippi.\n\n\n\nDNA: ayay DD EMe nn kbrky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/ecko/"
        },
        {
            "name": "Cartel",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Cartel.jpeg",
            "description": "Texas Top Notch Butler's Cartel was produced right here back in February of 2021.&nbsp; He is full littermate brother to Tonga and 1/2 brother to Kofi, Kaz and Peavy; sharing the same mom.&nbsp; Cartel is still young and has a lot of maturing to do but already looks extremely promising. Cartel is a blue and tan merle that carries chocolate and cream. This boy is health tested clear of CMR1, PRA-cord1, DM, HUU, JHC and Cystinuria 3&nbsp; Cartel has some amazing offspring out there and has only gotten better with age.&nbsp;\n\n\n\nStud Fee: $2500\n\n\n\nDNA: atat dd Coco EMe nn kyk Mm268",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/cartel/"
        },
        {
            "name": "Malakai",
            "gender": "Male",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/malakai1-1.jpg",
            "description": "Malakai comes to us by way of&nbsp; French Bullys and just turned a year old in late March of 2022. Kai is still young and has a lot of maturing to do, but already has great structure, is compact and thick with a massive noggin.&nbsp; He is a complete goof and just all around great dog.&nbsp; Kai is solid chocolate and carries both blue and cream. This boy is health tested clear of CMR1, PRA-cord1, DM, HUU, JHC and Cystinuria 3. Malakai is open for stud and we have the ability to ship same day or overnight.&nbsp;\n\n\n\nStud Fee: $2000\n\n\n\nDNA: aa coco Dd EMe nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/malakai/"
        },
        {
            "name": "Paper Trail",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/paper60628.jpg",
            "description": "Paper Trail was produced right here out of our very own Kayda and an outside male named Hush Money.&nbsp; Paper Trail is littermate brother to The Bread Winner, Cash Money and our girl, Dirty Money.  He is the biggest baby and loves everybody.  Paper has the most beautiful coat color and eyes as well as having great bone, a nice compact body and a huge head.  This stunning boy is health tested clear of&nbsp; JHC, HUU, PRA-Cord1, CMR1 and Cystinuria 3. Paper Trail has some amazing offspring out there already and we have big plans to run him to a few of our girls as well.  \n\n\n\nStud Fee: $2500\n\n\n\nDNA: aa dd coco bb EmEm NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/paper-trail/"
        },
        {
            "name": "The Bread Winner",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9554.jpg",
            "description": "The Bread Winner was produced right here out of our very own Kayda, and an outside male named Hush Money.&nbsp; He is littermate brother to both Cash Money and Paper Trail as well as Dirty Money.  All 4 have the DNA and looks to boot! This boy has the most beautiful coat color and eyes as well as the bone, dome and body to make him the total package.  Bread Winner&nbsp;is health tested clear of&nbsp; JHC,&nbsp; HUU, PRA-Cord1, CMR1 and Cystinuria 3.&nbsp;&nbsp;\n\n\n\nStud Fee: $2500\n\n\n\nDNA: ata coco bb Dd EmEm nn kyky\n\n\n\n\n\n\n\n.",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/the-bread-winner/"
        },
        {
            "name": "Beef",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april15y.jpg",
            "description": "Beef was imported from Hungary in April of 2022 from Small Heroes Kennel.&nbsp; He was born in December of 2021 and is maturing very nicely.&nbsp; Beef is out of Thien Than's Valentino x Small-Heroes Bully Melek and is standard colors only.&nbsp;He has amazing structure, great bone, a huge head with lots of wrinkles and the most laid back, gentle personality.  This boy is health tested clear of&nbsp; JHC, HUU, PRA-Cord1, CMR1 and Cystinuria 3.&nbsp;His littermate sister Vida can be seen on our females page. \n\n\n\nStud Fee: $1500 intro\n\n\n\nDNA: ayay DD EmEm nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/beef/"
        },
        {
            "name": "Cash Money",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/cash5-1.jpg",
            "description": "Cash Money AKA Cash is also out of our Kayda x Hush Money litter and littermate to both Paper Trail and Bread Winner and our girl, Dirty Money.&nbsp; He is solid chocolate carries blue and testable.&nbsp; Cash is short and compact with great structure.&nbsp; This boy is health tested clear of JHC, HUU, PRA-Cord1, CMR1 and Cystinuria 3. He is co-owned w/ a family member and is now open for stud service.\n\n\n\nStud Fee: 2K\n\n\n\nDNA: aa coco Bb Dd EmEm nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/cash-money/"
        },
        {
            "name": "ABKC Champion Yenko",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/yenko-june21u.jpg",
            "description": "Yenko is out of Yanmar x Rudolph and was produced right here in June of 2022.  His pedigree is special as he is Yanmar bred to a Party Monster daughter.  Yenko is standard colors but does carry pied.  He is health tested clear for  CMR1, PRA-cord1, DM, HUU and JHC.  Yenko is practically a clone of his daddy and we have high expectations for this amazing little guy! After his first show debut in the fall of 2022, Yenko earned his champion status before even reaching 9 months old.  We will continue showing him and try for his grand champion title next.  Yenko is now open for stud to approved females and is proven.\n\n\n\nStud Fee: 2K\n\n\n\nDNA: ayay DD EmEm NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/yenko/"
        },
        {
            "name": "Kaz",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/326.jpeg",
            "description": "Texas Top Notch Kaz the Wanderlust was produced here back in January of 2019.&nbsp; Kaz is full littermate sister to Kofi and 1/2 sister to Cartel, Peavy and Tonga. She has one of the very best personalities and is practically perfect in conformation.&nbsp; Kaz is built like a male and has produced some super nice off spring such as our very own Kayda and Astra.&nbsp; This girl is a blue fawn that carries both cocoa and cream.&nbsp; \n\n\n\nDNA: aya dd Coco EMe nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/kaz/"
        },
        {
            "name": "Peavy",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/peavy12.jpeg",
            "description": "Texas Top Notch Blinding Lights aka Peavy was produced here back in September of 2019.  Peavy is 1/2 sister to Cartel, Tonga and Kaz; all sharing the same mom. She is a small girl with great substance and structure as well as a very sweet demeanor and eagerness to please.  Peavy is blue and tan and carries both cocoa and cream.  This girl is health tested clear of JHC, HUU, PRA-Cord1, CMR1 and Cystinuria 3. She produced a beautiful litter with our boy, Thunder Cat and was then bred to Narco for her second breeding and produced our amazing boy, Kamikaze and our girl, Pita. Peavy will most likely be bred again in late 2023 to one of our studs.\n\n\n\nDNA: atat dd Coco EMe nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/peavy/"
        },
        {
            "name": "Kayda",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9353.jpg",
            "description": "Texas Top Notch Hardest to Love aka Kayda was produced here back in June of 2020.  She is a very well built female like her beautiful mom, Kaz.  Kayda is a solid cocoa that carries both chocolate and blue.  She is a super short, thick girl w/ an amazing personality just like her mom. Kayda is mom to Paper Trail, Bread Winner, Cash Money and Dirty Money.    \n\n\n\n\n\n\n\nDNA: aa coco Bb Dd EME kyky&nbsp;",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/kayda/"
        },
        {
            "name": "Rudolph",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/20221106_194410.jpeg",
            "description": "Texas Top Notch Life of the Party aka Rudolph was produced here back in October of 2020.  She is line bred out of our boy, Party Monster and our now retired, Trilogy.  Rudolph is a very petite girl that has very nice structure, great headpiece, and the most amazing temperment.  She produced an amazing litter w/ Yanmar in June of 2022 which resulted in our boy, ABKC CH Yenko and our girl, Yuli. She will be bred again in the fall of 2023\n\n\n\nDNA: ayay DD EMEM nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/rudolph/"
        },
        {
            "name": "ABKC Champion Yuki",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april1e.jpg",
            "description": "Texas Top Notch CH Yuki was produced here back in October of 2020.  She is a Yanmar daughter and that is very obvious looking at her build and characteristics.  This girl is 1/2 sister to Odyn, Yakka, Yenko and Yuli. Yuki is extremely muscular and has very nice conformation and movement.   She is health tested clear of JHC, HUU and CMR1. Yuki earned her ABKC Champion title in April of 2023 after her show debut in late 2022.  She will be bred in the fall of 2023.\n\n\n\n\n\n\n\nDNA: ayay DD EMEM NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/yuki/"
        },
        {
            "name": "Yakka",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_3498.jpeg",
            "description": "Bully B Bulldogs Yakka of Texas Top Notch was co-produced w/ breeder Brittany Bell in November of 2020 and  is out of Yanmar and her beautiful girl, Gigi.  She is 1/2 sister to both Odyn , Yuli, Yenko and Yuki. Yakka is a very small girl and has great substance and structure.  She is health tested clear of JHC, HUU, DM, PRA-Cord1, CMR1 and Cystinuria 3. This girl will most likely be bred in 2023 to one of our studs.\n\n\n\nDNA: ayay DD EMe NS kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/yakka/"
        },
        {
            "name": "Tonga",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april15a.jpg",
            "description": "Texas Top Notch Heartless Valentine aka Tonga was produced here back on Valentine's Day of 2021.&nbsp; She is full littermate sister to Cartel and 1/2 sister Kofi, Kaz and Peavy; all 4 being out of Taja.&nbsp; Tonga is a very athletic, well built girl who is super smart.&nbsp; She is a harlequin merle that carries both cocoa and blue.&nbsp; This girl is health tested clear of JHC, HUU DM, PRA_Cord1, CMR1 and Cystinuria 3. Tonga was bred to Malakai and that pairing produced our beautiful chocolate merle girl, Toka.&nbsp; She will most likely be bred again in the fall of 2023.\n\n\n\nDNA: aa Dd Coco EME nn kyky Mm269",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/tonga/"
        },
        {
            "name": "Astra",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_0801.jpg",
            "description": "Texas Top Notch Lilac Astra was produced here back in March of 2021 out of Kaz and 908s Own Type R.   She is 1/2 sister to Kayda. Astra is a very small, correct female who loves to be the center of attention.  This girl is health tested clear of JHC, HUU, DM, CMR1 and Cystinuria 3. She produced an amazing litter with Odyn in the fall of 2023.\n\n\n\n\n\n\n\nDNA: ata dd coco EME nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/astra/"
        },
        {
            "name": "Dirty Money",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/dirty1.jpg",
            "description": "Dirty Money was produced right here and is out of our very own, Kayda, and an outside male named Hush Money.  Dirty is littermate sister to Cash Money, Breadwinner and Paper Trail. This girl has the exact same DNA as her mom but also carries pied.  Dirty is health tested clear of JHC, HUU, PRA_Cord1, CMR1 and Cystinuria 3. She will most likely be bred to CH Yenko in late 2023.\n\n\n\nDNA: aa coco Bb Dd EMEM NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/dirty-money/"
        },
        {
            "name": "Vida",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9416.jpg",
            "description": "This extremely tiny girl was imported along with her brother, Beef,  from Hungary in April of 2022 from Small Heroes Kennel.  She is standard colors only and super tiny.  Vida is health tested clear of JHC, DM, HUU, PRA-Cord1, and CMR1. This girl is super athletic and very compact with excellent structure.  We plan to take her to  Odyn in 2023.  \n\n\n\nDNA: ayay DD EmEm nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/vida/"
        },
        {
            "name": "Yuli",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april27r.jpg",
            "description": "Yuli was produced right here in June of 2022 out of Yanmar x Rudolph.&nbsp; She and her brother Yenko are very special to us as they are out of Yanmar bred to a Party Monster daughter, putting both of our amazing boys together in one pedigree,&nbsp; Yuli is standard colors but does carry pied.&nbsp; She is health tested clear of&nbsp;&nbsp;JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3. We have big plans for this beautiful little girl!\n\n\n\nDNA: ayay DD EmEm NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/yuli/"
        },
        {
            "name": "Toka",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/toka.jpg",
            "description": "Texas Top Notch After Hours Toka was produced here in July of 2022 out of Malakai and Tonga. Toka is an aa chocolate merle girl that carries both blue and cream.  She is health tested clear of JHC, DM, HUU, PRA_Cord1, CMR1 and Cystinuria 3. We are thinking of pairing her with either Bread Winner or Paper Trail depending on how she develops when she is of age.  \n\n\n\nDNA: aa coco Dd Ee nn kyky Mm268",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/toka/"
        },
        {
            "name": "Nika",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/NIKA1.jpeg",
            "description": "Nika was the 2nd female French Bullog we added to our program back in 2015.&nbsp; She was imported from Lithuania and is the main backbone to all of our color dogs today.&nbsp; Nika is mom to Taja, who is mom, grandma and great grandma to most all of our color dogs we have currently.&nbsp; Nika has since been retired and is living out her days with her wonderful owner Claire in Texas.\n\n\n\nDNA: aya Dd EMEM nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/nika/"
        },
        {
            "name": "Nola",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/2277.jpeg",
            "description": "Nola was the very first French Bulldog female we introduced to start our program back in 2015.&nbsp; She was imported from Lithuania and produced many nice dogs over the years; several can be seen on our Production Page.&nbsp; Nola has since retired and is living out her days being loved and spoiled by Stephanie and family in Texas.\n\n\n\nDNA: ayay DD EMEM NS kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/nola/"
        },
        {
            "name": "Toki",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/015.jpeg",
            "description": "Toki was the 3rd female French Bulldog we added to our growing program back in 2015,&nbsp; She traveled to us all the way from Hungary as a 4 month old pup.&nbsp; This girl is the backbone of our standard dogs here today.&nbsp;&nbsp;\n\n\n\nDNA: ayay DD EME NS kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/toki/"
        },
        {
            "name": "Trilogy",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/trilogy2.jpeg",
            "description": "Texas Top Notch Trill aka Trilogy was produced right here back in 2017 and is out of now retired dogs Ecko and Toki.&nbsp; This girl is super small and compact with the most sweet, comical personality.&nbsp; She is mother to our dogs Odyn and Rudolph as well as several others on our Produced Page.&nbsp; Trilogy and her mom are both retired&nbsp; now and are living out their lives together spoiled rotten with a family in Michigan.\n\n\n\nDNA: ayay DD EMEM nn kbrky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/trilogy/"
        },
        {
            "name": "Taja",
            "gender": "Female",
            "is_retired": true,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/production26.jpeg",
            "description": "Texas Top Notch Beauty Behind the Madness aka Taja was produced right here back in 2017 and is out of our girl Nika and an outside stud named Cruz.&nbsp; This girl really left her mark here being the mom, grandma and great grandma to several of our dogs today.&nbsp; Taja seemed to outproduce herself with each and every breeding.&nbsp; This beautiful girl is now retired and spoiled rotten with her wonderful owner Victoria in Texas.\n\n\n\nDNA: ata dd Coco EMEM nn kyky",
            "status": "Retired",
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/taja/"
        },
        {
            "name": "Pita",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/08/Pita2-1.jpg",
            "description": "Pita is out of Narco and our girl, Peavy.  She is full littermate sister to our boy, Kamikaze. Pita is exactly why we did this breeding as she is small, compact and correct with the most beautiful face and great bone.  She is health tested clear of JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3. Her personality is the absolute best as she loves to be held and loves attention.  Pita should be a great asset to our program in the future.\n\n\n\nDNA: atat dd coco EMe nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/pita/"
        },
        {
            "name": "Aspen",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/08/FB_IMG_1689609639627.jpg",
            "description": "Aspen was produced here in September of 2022 and he is out of Thunder Cat x Kaz.  This beautiful boy is a maskless chocolate fawn that carries tan points, blue and cream.  Aspen is health tested clear of JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3.  We are excited to see how this handsome guy matures and look forward to incorporating him into our breeding program. He is currently open for stud.\n\n\n\nStud Fee:  2K\n\n\n\nDNA: ayat coco Dd Ee nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/aspen/"
        },
        {
            "name": "Kamikaze",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0863.jpg",
            "description": "Kamikaze is our stunning lilac and tan merle boy that was produced right here out of Narco x Peavy in Decemeber of 2022.  He is full littermate brother to our girl, Pita.  Kaze is a lilac and tan merle that carries cream.  He has excellent structure and we are planning to start showing him once he hits 6 months old.  Kamikaze is health tested clear of CMR1, PRA-cord1, HUU, JHC and Cystinuria 3.  He is open for stud.\n\n\n\n                                                                        Stud Fee: 2K\n\n\n\nDNA: ata dd coco EMe nn kyky Mm268",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/kamikaze/"
        },
        {
            "name": "Neva",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0760.jpg",
            "description": "Neva is a beautiful little cream girl that is off Odyn and Scarlett (owned by a friend) and was born in February of 2023.  She is an amazing little girl with phenomenal structure, great bone and a beautiful head piece.  Neva is health tested clear of JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3.  We have big plans for this perfect little girl and hope to get her into the show ring later this year as well\n\n\n\nDNA: aya DD ee NS kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/neva/"
        },
        {
            "name": "Pyper",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/06/pyper30628.jpg",
            "description": "Pyper Rose is a beautiful fawn color carrier that we produced in December of 2021 out of Kaz x Griffin owned by Tasha Chasteen.  This girl puts alot of males to shame with her huge head and rope, crazy thick substance and bone.  Pyper is a fawn that carries blue, cocoa, cream and tan points. She is health tested clear of JHC, HUU, DM, PRA-Cord1, CMR1 and Cystinuria 3. Pyper was bred to Cash Money for her first breeding and we are looking forward to seeing those puppies grow and mature.\n\n\n\n\n\n\n\nDNA: ayat Dd Coco EMe nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/pyper/"
        },
        {
            "name": "Louie",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/12/IMG_9304.jpg",
            "description": "Louie is an amazing chocolate and tan male covered in cream sired by our male, Malakai and grandsired by our boy, Kofi.  Louie is a solid, structurally correct male with great bone, a huge head and a compact body with no tail.  He is a very nice representation of the breed with a super sweet, laid back temperament to boot.  Louie is health panel clear of JHC, HUU, CMR1, DM.  His C3 and PRA-CRD1 testing is pending. \n\n\n\n\n\n\n\nStud Fee: 2K\n\n\n\n                                                                            DNA: ata DD coco ee nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/louie/"
        },
        {
            "name": "High Roller",
            "gender": "Male",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0762.jpg",
            "description": "This stunning guy was produced right here in August of 2023 and is out of Cash Money x Pyper Rose.  He is an amazing looking young stud with the dna to match!  He is a lilac and tan that carries cream and testable. Roller is health tested clear of JHC, DM, HUU, PRA-Cord1,  CMR1 and Cystinuria 3.  We are excited to watch this beautiful boy mature and have big plans for him in our program.  We hope to have him open for stud in the summer of 2024.\n\n\n\n\n\n\n\n                                                             \n\n\n\nDNA: ata dd coco Bb eme nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/high-roller/"
        },
        {
            "name": "Bunny",
            "gender": "Female",
            "is_retired": false,
            "profile_photo": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/02/IMG_0839.jpg",
            "description": "Bunny was born on September 11, 2023.  She is out of The Breadwinner x Sassy (Griffin x Kaz). This beautiful girl is staying super short but has crazy bone and substance for a female.  Bunny is health tested clear of JHC, DM, HUU, PRA-Cord1, CMR1 and Cystinuria 3.  We have big plans for this beautiful girl.\n\n\n\n\n\n\n\nDNA: ata Coco Bb Dd emem nn kyky",
            "status": null,
            "pedigree_link": "https://texastopnotchfrenchies.com/dogs/bunny/"
        }
    ],
    "health_infos": [
        {
            "dna": "ayay DD EMEM NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Yanmar"
        },
        {
            "dna": "ayay DD Coco EME nn kyky\n\n\n\n​",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Party Monster"
        },
        {
            "dna": "ayay DD EMe NS KbrKy",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Odyn"
        },
        {
            "dna": "atat coco Dd EME nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Thunder Cat"
        },
        {
            "dna": "ata dd Coco EMEM nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Kofi"
        },
        {
            "dna": "ayay dd EMEM NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Izzo"
        },
        {
            "dna": "ayay DD EMe nn kbrky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Ecko"
        },
        {
            "dna": "atat dd Coco EMe nn kyk Mm268",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Cartel"
        },
        {
            "dna": "aa coco Dd EMe nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Malakai"
        },
        {
            "dna": "aa dd coco bb EmEm NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Paper Trail"
        },
        {
            "dna": "ata coco bb Dd EmEm nn kyky\n\n\n\n\n\n\n\n.",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "The Bread Winner"
        },
        {
            "dna": "ayay DD EmEm nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Beef"
        },
        {
            "dna": "aa coco Bb Dd EmEm nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Cash Money"
        },
        {
            "dna": "ayay DD EmEm NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "ABKC Champion Yenko"
        },
        {
            "dna": "aya dd Coco EMe nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Kaz"
        },
        {
            "dna": "atat dd Coco EMe nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Peavy"
        },
        {
            "dna": "aa coco Bb Dd EME kyky&nbsp;",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Kayda"
        },
        {
            "dna": "ayay DD EMEM nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Rudolph"
        },
        {
            "dna": "ayay DD EMEM NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "ABKC Champion Yuki"
        },
        {
            "dna": "ayay DD EMe NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Yakka"
        },
        {
            "dna": "aa Dd Coco EME nn kyky Mm269",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Tonga"
        },
        {
            "dna": "ata dd coco EME nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Astra"
        },
        {
            "dna": "aa coco Bb Dd EMEM NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Dirty Money"
        },
        {
            "dna": "ayay DD EmEm nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Vida"
        },
        {
            "dna": "ayay DD EmEm NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Yuli"
        },
        {
            "dna": "aa coco Dd Ee nn kyky Mm268",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Toka"
        },
        {
            "dna": "aya Dd EMEM nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Nika"
        },
        {
            "dna": "ayay DD EMEM NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Nola"
        },
        {
            "dna": "ayay DD EME NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Toki"
        },
        {
            "dna": "ayay DD EMEM nn kbrky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Trilogy"
        },
        {
            "dna": "ata dd Coco EMEM nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Taja"
        },
        {
            "dna": "atat dd coco EMe nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Pita"
        },
        {
            "dna": "ayat coco Dd Ee nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Aspen"
        },
        {
            "dna": "ata dd coco EMe nn kyky Mm268",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Kamikaze"
        },
        {
            "dna": "aya DD ee NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Neva"
        },
        {
            "dna": "ayat Dd Coco EMe nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Pyper"
        },
        {
            "dna": "ata DD coco ee nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Louie"
        },
        {
            "dna": "ata dd coco Bb eme nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "High Roller"
        },
        {
            "dna": "ata Coco Bb Dd emem nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Bunny"
        },
        {
            "dna": "ayay DD EMEM NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Yanmar"
        },
        {
            "dna": "ayay DD Coco EME nn kyky\n\n\n\n​",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Party Monster"
        },
        {
            "dna": "ayay DD EMe NS KbrKy",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Odyn"
        },
        {
            "dna": "atat coco Dd EME nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Thunder Cat"
        },
        {
            "dna": "ata dd Coco EMEM nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Kofi"
        },
        {
            "dna": "ayay dd EMEM NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Izzo"
        },
        {
            "dna": "ayay DD EMe nn kbrky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Ecko"
        },
        {
            "dna": "atat dd Coco EMe nn kyk Mm268",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Cartel"
        },
        {
            "dna": "aa coco Dd EMe nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Malakai"
        },
        {
            "dna": "aa dd coco bb EmEm NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Paper Trail"
        },
        {
            "dna": "ata coco bb Dd EmEm nn kyky\n\n\n\n\n\n\n\n.",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "The Bread Winner"
        },
        {
            "dna": "ayay DD EmEm nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Beef"
        },
        {
            "dna": "aa coco Bb Dd EmEm nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Cash Money"
        },
        {
            "dna": "ayay DD EmEm NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "ABKC Champion Yenko"
        },
        {
            "dna": "aya dd Coco EMe nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Kaz"
        },
        {
            "dna": "atat dd Coco EMe nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Peavy"
        },
        {
            "dna": "aa coco Bb Dd EME kyky&nbsp;",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Kayda"
        },
        {
            "dna": "ayay DD EMEM nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Rudolph"
        },
        {
            "dna": "ayay DD EMEM NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "ABKC Champion Yuki"
        },
        {
            "dna": "ayay DD EMe NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Yakka"
        },
        {
            "dna": "aa Dd Coco EME nn kyky Mm269",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Tonga"
        },
        {
            "dna": "ata dd coco EME nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Astra"
        },
        {
            "dna": "aa coco Bb Dd EMEM NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Dirty Money"
        },
        {
            "dna": "ayay DD EmEm nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Vida"
        },
        {
            "dna": "ayay DD EmEm NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Yuli"
        },
        {
            "dna": "aa coco Dd Ee nn kyky Mm268",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Toka"
        },
        {
            "dna": "aya Dd EMEM nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Nika"
        },
        {
            "dna": "ayay DD EMEM NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Nola"
        },
        {
            "dna": "ayay DD EME NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Toki"
        },
        {
            "dna": "ayay DD EMEM nn kbrky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Trilogy"
        },
        {
            "dna": "ata dd Coco EMEM nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Taja"
        },
        {
            "dna": "atat dd coco EMe nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Pita"
        },
        {
            "dna": "ayat coco Dd Ee nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Aspen"
        },
        {
            "dna": "ata dd coco EMe nn kyky Mm268",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Kamikaze"
        },
        {
            "dna": "aya DD ee NS kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Neva"
        },
        {
            "dna": "ayat Dd Coco EMe nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Pyper"
        },
        {
            "dna": "ata DD coco ee nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Louie"
        },
        {
            "dna": "ata dd coco Bb eme nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "High Roller"
        },
        {
            "dna": "ata Coco Bb Dd emem nn kyky",
            "carrier_status": "",
            "extra_info": "",
            "dog_name": "Bunny"
        }
    ],
    "photos": [
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/yan4.jpg",
            "alt": "Yanmar's photo",
            "dog_name": "Yanmar"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_3407.jpeg",
            "alt": "Party Monster's photo",
            "dog_name": "Party Monster"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Odyn-1.jpeg",
            "alt": "Odyn's photo",
            "dog_name": "Odyn"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9501-1.jpg",
            "alt": "Thunder Cat's photo",
            "dog_name": "Thunder Cat"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Kofi.jpeg",
            "alt": "Kofi's photo",
            "dog_name": "Kofi"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/izzo.jpeg",
            "alt": "Izzo's photo",
            "dog_name": "Izzo"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/312.jpeg",
            "alt": "Ecko's photo",
            "dog_name": "Ecko"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Cartel.jpeg",
            "alt": "Cartel's photo",
            "dog_name": "Cartel"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/malakai1-1.jpg",
            "alt": "Malakai's photo",
            "dog_name": "Malakai"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/paper60628.jpg",
            "alt": "Paper Trail's photo",
            "dog_name": "Paper Trail"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9554.jpg",
            "alt": "The Bread Winner's photo",
            "dog_name": "The Bread Winner"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april15y.jpg",
            "alt": "Beef's photo",
            "dog_name": "Beef"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/cash5-1.jpg",
            "alt": "Cash Money's photo",
            "dog_name": "Cash Money"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/yenko-june21u.jpg",
            "alt": "ABKC Champion Yenko's photo",
            "dog_name": "ABKC Champion Yenko"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/326.jpeg",
            "alt": "Kaz's photo",
            "dog_name": "Kaz"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/peavy12.jpeg",
            "alt": "Peavy's photo",
            "dog_name": "Peavy"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9353.jpg",
            "alt": "Kayda's photo",
            "dog_name": "Kayda"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/20221106_194410.jpeg",
            "alt": "Rudolph's photo",
            "dog_name": "Rudolph"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april1e.jpg",
            "alt": "ABKC Champion Yuki's photo",
            "dog_name": "ABKC Champion Yuki"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_3498.jpeg",
            "alt": "Yakka's photo",
            "dog_name": "Yakka"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april15a.jpg",
            "alt": "Tonga's photo",
            "dog_name": "Tonga"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_0801.jpg",
            "alt": "Astra's photo",
            "dog_name": "Astra"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/dirty1.jpg",
            "alt": "Dirty Money's photo",
            "dog_name": "Dirty Money"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9416.jpg",
            "alt": "Vida's photo",
            "dog_name": "Vida"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april27r.jpg",
            "alt": "Yuli's photo",
            "dog_name": "Yuli"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/toka.jpg",
            "alt": "Toka's photo",
            "dog_name": "Toka"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/NIKA1.jpeg",
            "alt": "Nika's photo",
            "dog_name": "Nika"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/2277.jpeg",
            "alt": "Nola's photo",
            "dog_name": "Nola"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/015.jpeg",
            "alt": "Toki's photo",
            "dog_name": "Toki"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/trilogy2.jpeg",
            "alt": "Trilogy's photo",
            "dog_name": "Trilogy"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/production26.jpeg",
            "alt": "Taja's photo",
            "dog_name": "Taja"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/08/Pita2-1.jpg",
            "alt": "Pita's photo",
            "dog_name": "Pita"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/08/FB_IMG_1689609639627.jpg",
            "alt": "Aspen's photo",
            "dog_name": "Aspen"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0863.jpg",
            "alt": "Kamikaze's photo",
            "dog_name": "Kamikaze"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0760.jpg",
            "alt": "Neva's photo",
            "dog_name": "Neva"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/06/pyper30628.jpg",
            "alt": "Pyper's photo",
            "dog_name": "Pyper"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/12/IMG_9304.jpg",
            "alt": "Louie's photo",
            "dog_name": "Louie"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0762.jpg",
            "alt": "High Roller's photo",
            "dog_name": "High Roller"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/02/IMG_0839.jpg",
            "alt": "Bunny's photo",
            "dog_name": "Bunny"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/yan4.jpg",
            "alt": "Yanmar's photo",
            "dog_name": "Yanmar"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_3407.jpeg",
            "alt": "Party Monster's photo",
            "dog_name": "Party Monster"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Odyn-1.jpeg",
            "alt": "Odyn's photo",
            "dog_name": "Odyn"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9501-1.jpg",
            "alt": "Thunder Cat's photo",
            "dog_name": "Thunder Cat"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Kofi.jpeg",
            "alt": "Kofi's photo",
            "dog_name": "Kofi"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/izzo.jpeg",
            "alt": "Izzo's photo",
            "dog_name": "Izzo"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/312.jpeg",
            "alt": "Ecko's photo",
            "dog_name": "Ecko"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/Cartel.jpeg",
            "alt": "Cartel's photo",
            "dog_name": "Cartel"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/malakai1-1.jpg",
            "alt": "Malakai's photo",
            "dog_name": "Malakai"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/paper60628.jpg",
            "alt": "Paper Trail's photo",
            "dog_name": "Paper Trail"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9554.jpg",
            "alt": "The Bread Winner's photo",
            "dog_name": "The Bread Winner"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april15y.jpg",
            "alt": "Beef's photo",
            "dog_name": "Beef"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/cash5-1.jpg",
            "alt": "Cash Money's photo",
            "dog_name": "Cash Money"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/yenko-june21u.jpg",
            "alt": "ABKC Champion Yenko's photo",
            "dog_name": "ABKC Champion Yenko"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/326.jpeg",
            "alt": "Kaz's photo",
            "dog_name": "Kaz"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/peavy12.jpeg",
            "alt": "Peavy's photo",
            "dog_name": "Peavy"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9353.jpg",
            "alt": "Kayda's photo",
            "dog_name": "Kayda"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/20221106_194410.jpeg",
            "alt": "Rudolph's photo",
            "dog_name": "Rudolph"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april1e.jpg",
            "alt": "ABKC Champion Yuki's photo",
            "dog_name": "ABKC Champion Yuki"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_3498.jpeg",
            "alt": "Yakka's photo",
            "dog_name": "Yakka"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april15a.jpg",
            "alt": "Tonga's photo",
            "dog_name": "Tonga"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_0801.jpg",
            "alt": "Astra's photo",
            "dog_name": "Astra"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/dirty1.jpg",
            "alt": "Dirty Money's photo",
            "dog_name": "Dirty Money"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/IMG_9416.jpg",
            "alt": "Vida's photo",
            "dog_name": "Vida"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/april27r.jpg",
            "alt": "Yuli's photo",
            "dog_name": "Yuli"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/toka.jpg",
            "alt": "Toka's photo",
            "dog_name": "Toka"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/NIKA1.jpeg",
            "alt": "Nika's photo",
            "dog_name": "Nika"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/2277.jpeg",
            "alt": "Nola's photo",
            "dog_name": "Nola"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/015.jpeg",
            "alt": "Toki's photo",
            "dog_name": "Toki"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/trilogy2.jpeg",
            "alt": "Trilogy's photo",
            "dog_name": "Trilogy"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2022/12/production26.jpeg",
            "alt": "Taja's photo",
            "dog_name": "Taja"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/08/Pita2-1.jpg",
            "alt": "Pita's photo",
            "dog_name": "Pita"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/08/FB_IMG_1689609639627.jpg",
            "alt": "Aspen's photo",
            "dog_name": "Aspen"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0863.jpg",
            "alt": "Kamikaze's photo",
            "dog_name": "Kamikaze"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0760.jpg",
            "alt": "Neva's photo",
            "dog_name": "Neva"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/06/pyper30628.jpg",
            "alt": "Pyper's photo",
            "dog_name": "Pyper"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2023/12/IMG_9304.jpg",
            "alt": "Louie's photo",
            "dog_name": "Louie"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/01/IMG_0762.jpg",
            "alt": "High Roller's photo",
            "dog_name": "High Roller"
        },
        {
            "photo_url": "https://texastopnotchfrenchies.com/wp-content/uploads/2024/02/IMG_0839.jpg",
            "alt": "Bunny's photo",
            "dog_name": "Bunny"
        }
    ],
    "breedings": [
        {
            "breeding_date": "2022-12-02T21:09:16",
            "expected_birth_date": null,
            "description": "\n<p><strong><em>New Breedings Planned for Summer 2023 Coming Soon&#8230;&#8230;&#8230;.</em></strong></p>\n",
            "link": "https://texastopnotchfrenchies.com/breedings/narco-x-peavy/",
            "title": "",
            "female_dog_name": null,
            "male_dog_name": null
        }
    ],
    "productions": [
        {
            "name": "Louie",
            "description": "\n<p>Past puppy &#8220;Louie&#8221; out of Buffalo x Star owned and loved by Michael and Katie in Texas</p>\n",
            "owner": null,
            "sire_name": null,
            "dam_name": null,
            "gender": "Male",
            "dog_names": [],
            "profile_photo": 1613
        },
        {
            "name": "Baxter",
            "description": "\n<p>Past puppy &#8220;Baxter&#8221; out of Paper Trail x Roxy owned and loved by Jeff and family in Texas</p>\n",
            "owner": null,
            "sire_name": null,
            "dam_name": null,
            "gender": "Male",
            "dog_names": [],
            "profile_photo": 1614
        },
        {
            "name": "Tuffy Lou",
            "description": "\n<p>Past puppy &#8220;Tuffy Lou&#8221; out of Odyn x Astra owned and loved by Erin and Bennie in Texas</p>\n",
            "owner": null,
            "sire_name": null,
            "dam_name": null,
            "gender": "Male",
            "dog_names": [],
            "profile_photo": 1597
        },
        {
            "name": "Winter",
            "description": "\n<p>Past puppy &#8220;Winter&#8221; out of Thunder Cat x Tonga owned and loved by Dora and family in Arkansas</p>\n",
            "owner": null,
            "sire_name": null,
            "dam_name": null,
            "gender": "Male",
            "dog_names": [],
            "profile_photo": 1595
        },
        {
            "name": "Louis",
            "description": "\n<p>Past puppy &#8220;Louis&#8221; out of Kayda x Judge owned and loved by Angela and family in Texas</p>\n",
            "owner": null,
            "sire_name": null,
            "dam_name": null,
            "gender": "Male",
            "dog_names": [],
            "profile_photo": 1593
        },
        {
            "name": "Mera Jolee",
            "description": "\n<p>Past puppy &#8220;Mera Jolee&#8221; out of Kayda x Judge owned and loved by Donna and Greg in Mississippi</p>\n",
            "owner": null,
            "sire_name": null,
            "dam_name": null,
            "gender": "Male",
            "dog_names": [],
            "profile_photo": 1579
        },
        {
            "name": "Bunny Biscuits",
            "description": "\n<p>Past puppy &#8220;Bunny Biscuits&#8221; out of the Bread Winner x Sassy owned and loved by us</p>\n",
            "owner": null,
            "sire_name": null,
            "dam_name": null,
            "gender": "Male",
            "dog_names": [],
            "profile_photo": 1519
        },
        {
            "name": "Ransom",
            "description": "\n<p>Past puppy &#8220;Ransom&#8221; out of Paper Trail x Peavy owned and loved by David and Sherry and family in Texas</p>\n",
            "owner": null,
            "sire_name": null,
            "dam_name": null,
            "gender": "Male",
            "dog_names": [],
            "profile_photo": 1576
        },
        {
            "name": "Cocoa Pebbles and Thor",
            "description": "\n<p>Past puppies &#8220;Cocoa Pebbles&#8221; out of Kayda x Judge and &#8220;Thor&#8221; out of Paper Trail x Peavy owned and loved by Chad and family in Texas</p>\n",
            "owner": null,
            "sire_name": null,
            "dam_name": null,
            "gender": "Male",
            "dog_names": [],
            "profile_photo": 1574
        },
        {
            "name": "Pricilla Jelly Bean Jo",
            "description": "\n<p>Past puppy &#8220;Pricilla Jelly Bean Jo&#8221; out of Thunder Cat x Tonga owned and loved by Devon and family in Texas</p>\n",
            "owner": null,
            "sire_name": null,
            "dam_name": null,
            "gender": "Male",
            "dog_names": [],
            "profile_photo": 1569
        }
    ]
}